# Version:1.0 MMMC View Definition File
# Do Not Remove Above Line

create_library_set -name libset_slow\
   -timing\
    [list /classes/ece5746/asap7libs/lib/asap7sc7p5t_24_INVBUF_RVT_TT.lib /classes/ece5746/asap7libs/lib/asap7sc7p5t_24_AO_RVT_TT.lib /classes/ece5746/asap7libs/lib/asap7sc7p5t_24_OA_RVT_TT.lib /classes/ece5746/asap7libs/lib/asap7sc7p5t_24_SEQ_RVT_TT.lib /classes/ece5746/asap7libs/lib/asap7sc7p5t_24_SIMPLE_RVT_TT.lib]

   
create_library_set -name libset_fast\
   -timing\
    [list /classes/ece5746/asap7libs/lib/asap7sc7p5t_24_INVBUF_RVT_TT.lib /classes/ece5746/asap7libs/lib/asap7sc7p5t_24_AO_RVT_TT.lib /classes/ece5746/asap7libs/lib/asap7sc7p5t_24_OA_RVT_TT.lib /classes/ece5746/asap7libs/lib/asap7sc7p5t_24_SEQ_RVT_TT.lib /classes/ece5746/asap7libs/lib/asap7sc7p5t_24_SIMPLE_RVT_TT.lib]

create_rc_corner -name RC_corner_25\
   -T 25\
   -qx_tech_file /classes/ece5746/asap7libs/qrc/qrcTechFile_typ03_scaled4xV06

create_delay_corner -name delayCorner_slow\
   -library_set libset_slow\
   -rc_corner RC_corner_25

create_delay_corner -name delayCorner_fast\
   -library_set libset_fast\
   -rc_corner RC_corner_25

# Edit this with your sdc file generated after synthesis
create_constraint_mode -name common\
   -sdc_files\
   ./dist_sort.RVT.1980.syn.sdc

create_analysis_view -name default_setup_view -constraint_mode common -delay_corner delayCorner_slow
create_analysis_view -name default_hold_view -constraint_mode common -delay_corner delayCorner_fast

set_analysis_view -setup [list default_setup_view ] -hold [list default_hold_view ]
